package chap04_ex_answer;

public class Ex10 {

  public static void main(String[] args) {
    
    // 다음 2차원 배열 T를 90도 회전하세요.

    /*
     * 1 1 1 1 1          0 0 0 0 1
     * 0 0 1 0 0          0 0 0 0 1
     * 0 0 1 0 0   --->   1 1 1 1 1
     * 0 0 1 0 0          0 0 0 0 1
     * 0 0 1 0 0          0 0 0 0 1
     * ----------------------------
     *    [0][0]   --->   [0][4]
     *    [0][1]   --->   [1][4]
     *    [0][2]   --->   [2][4]
     *    [0][3]   --->   [3][4]
     *    [0][4]   --->   [4][4]
     *   
     *    [1][0]   --->   [0][3]
     *    [1][1]   --->   [1][3]
     *    [1][2]   --->   [2][3]
     *    [1][3]   --->   [3][3]
     *    [1][4]   --->   [4][3]
     *    ...   
     * ----------------------------
     *    [i][j]   --->   [j][4-i]
     */
    
    int[][] T = {
        {1, 1, 1, 1, 1},
        {0, 0, 1, 0, 0},
        {0, 0, 1, 0, 0},
        {0, 0, 1, 0, 0},
        {0, 0, 1, 0, 0}
    };
    
    // T가 90도 회전한 상태의 값을 temporary에 저장합니다.
    int[][] temporary = new int[5][5];
    
    for(int i = 0; i < T.length; i++) {
      for(int j = 0; j < T[i].length; j++) {
        temporary[j][4-i] = T[i][j];
      }
    }
    
    // T의 참조를 temporary의 참조로 바꿉니다.
    T = temporary;
    
    for(int i = 0; i < T.length; i++) {
      for(int j = 0; j < T[i].length; j++) {
        System.out.print(String.format("%-2d", T[i][j]));  // %2d는 항상 2자리로 정수를 표시합니다.
                                                           // 마이너스(-)는 공백이 필요하면 공백을 정수 앞에 두라는 의미입니다.
      }
      System.out.println();
    }
    
  }
  
}
